/*
SQLyog Ultimate v12.09 (32 bit)
MySQL - 5.5.45 : Database - test_base
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
/*Table structure for table `brands` */

DROP TABLE IF EXISTS `brands`;

CREATE TABLE `brands` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `brands` */

insert  into `brands`(`id`,`name`) values (1,'Favourite'),(2,'Arte Lamp'),(3,'Chiaro'),(4,'Globo'),(5,'Velante'),(6,'Wertmark'),(7,'Максисвет'),(8,'Omnilux'),(9,'Maytoni'),(10,'Eglo'),(11,'LGO'),(12,'Lussole'),(13,'Mantra'),(14,'Ambiente by Brizzi'),(15,'Eurosvet'),(16,'Nowodvorski'),(17,'Divinare'),(18,'MW-Light'),(19,'Alfa'),(20,'IDLamp'),(21,'Bogate`s'),(22,'Brilliant'),(23,'Sforzin Illuminazione'),(24,'Аврора'),(25,'Zaklad Stolarski'),(26,'Рассвет'),(27,'Regenbogen Life'),(28,'LOFT'),(29,'TK Lighting'),(30,'DeMarkt'),(31,'Sigma'),(32,'Жар-птица'),(33,'Brizzi modern'),(34,'Namat'),(35,'Sonex'),(36,'Тарьсма'),(37,'Odeon Light'),(38,'Markslojd');

/*Table structure for table `catalog_products` */

DROP TABLE IF EXISTS `catalog_products`;

CREATE TABLE `catalog_products` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL DEFAULT '',
  `price` decimal(10,2) DEFAULT NULL,
  `existence` enum('1','2') COLLATE utf8_unicode_ci NOT NULL DEFAULT '1',
  `image` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `brand_id` int(10) unsigned DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `catalog_products_brand_id_foreign` (`brand_id`),
  CONSTRAINT `catalog_products_brand_id_foreign` FOREIGN KEY (`brand_id`) REFERENCES `brands` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=101 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

/*Data for the table `catalog_products` */

insert  into `catalog_products`(`id`,`name`,`price`,`existence`,`image`,`brand_id`) values (1,'Светильник подвесной Haut 1367-1P','6600.00','1','071119_1.jpg',1),(2,'Потолочный светильник Vassoio A9205PL-3GO','11843.00','1','079937_1.jpg',2),(3,'Люстра Фьюжен 392015110','28700.00','1','092968_1_1.jpg',3),(4,'Светильник  Lord 54330-2','3490.00','1','016993_1.jpg',4),(5,'Люстра 142-503-05','11997.00','2','025283_1_1.jpg',5),(6,'Светильник потолочный Virginia WE354.03.627','12515.00','1','058785_1.jpg',6),(7,'Подвесной светильник Н Мозаика 2-9497-1-SY E27','1940.00','1','062954_1.jpg',7),(8,'Люстра OML-39907-03','4140.00','1','094649_01.jpg',8),(9,'Люстра ELEGANT 51 ARM610-03-W','10190.00','2','077713_1_1.jpg',9),(10,'Светильник подвесной Milagro 90008','4390.00','1','044040_1.jpg',10),(11,'Потолочный светильник LSP-0188','4020.00','1','072538_1.jpg',11),(12,'Подвесной светильник Vetere LSF-2306-01','3386.00','2','072314_1.jpg',12),(13,'Потолочный светильник MN 0413','16839.00','1','083405_1.jpg',13),(14,'Подвесная люстра Ambiente by Brizzi Alicante 8888/8+8 AB Leaf Crystal','92995.00','1','083019_01.jpg',14),(15,'Люстра 22404/8 черненое золото','7130.00','1','057622_1.jpg',15),(16,'Настенно-потолочный светильник Nowodvorski 6906 Airplane III','5976.00','2','116423_01.jpg',16),(17,'Потолочная люстра Divinare 2247/03 PL-6','19900.00','1','118590_01.jpg',17),(18,'Люстра Грация 358019405','8500.00','2','',18),(19,'Светильник настенно-потолочный Specchio 48510','400.00','2','016736_1.jpg',4),(20,'Светильник потолочный Lord 54330-3','4970.00','1','016994_1_1.jpg',4),(21,'Люстра 51524','3990.00','1','035068_1.jpg',4),(22,'Люстра Bali White 18525','7942.00','2','032672_1.jpg',19),(23,'Потолочная люстра IDLamp Arien 400/3PF-LEDWhitechrome','34490.00','1','102950_1.jpg',20),(24,'Подвесная люстра Bogate`s 212/8 Strotskis','20651.00','1','109759_01.jpg',21),(25,'Потолочный светильник Maxime 49211','15900.00','1','080816_1.jpg',4),(26,'Светильник настенно-потолочный Specchio 48513','700.00','1','016737_1_1.jpg',4),(27,'Светильник подвесной Amira 77379/77','6231.00','1','048997_1.jpg',22),(28,'Подвесной светильник Martini Granata 1417.32','38630.00','1','058011_1.jpg',23),(29,'Подвесная люстра Аврора Лаура 10073-5L','7980.00','2','100974_01.jpg',24),(30,'Подвесной светильник Zaklad Stolarski 71 сосна','2344.00','1','104711_01.jpg',25),(31,'Люстра Каскад РЛ 5505ПХ/С','4020.00','1','030486_1.jpg',26),(32,'Люстра Фьюжен 392014025','36660.00','2','066917_01.jpg',27),(33,'Подвесной светильник Sussy LSP-9628','21445.00','1','072596_1.jpg',28),(34,'Подвесная люстра TK Lighting 1887 Julia 3','5278.00','1','116452_01.jpg',29),(35,'Спот Лайн 518020203','1710.00','2','068761_1.jpg',30),(36,'Люстра Liana 17557','9971.00','1','062648_1.jpg',31),(37,'Люстра Медея  Л08П3-02-Ш','2190.00','1','030691_01.jpg',32),(38,'Подвесной светильник BD 03200/3 Chrome','5400.00','1','082847_1.jpg',33),(39,'Люстра 1951 Cezar 5','8120.00','1','058726_1.jpg',34),(40,'Потолочный светильник Sonex Quadro Blue 364','2567.00','2','023197_01.jpg',35),(41,'Подвесная люстра Тарьсма Гамма-6','21918.00','1','119567_01.jpg',36),(42,'Настенно-потолочный светильник Odeon Light Blois 2603/1C','1662.00','1','059413_1_1.jpg',37),(43,'Светильник потолочный Tobo 413423','5037.00','1','021375_1.jpg',38),(44,'Люстра Silva 2695/5 ODL15 000 коричневая с позолотой/керамические розы','8416.00','1','085520_1.jpg',2),(45,'Люстра Spazio 2489-8C','11396.00','2','036777_1.jpg',1),(46,'Подвесной светильник Модерн 2-4797-3-CR+YN E27','10730.00','1','063470_1.jpg',7),(47,'Люстра Cevedale LSQ-6907-07','8289.00','1','010352_1.jpg',12),(48,'Подвесной светильник Omnilux OML-44506-01','1480.00','2','098573_01.jpg',8),(49,'Потолочная люстра Eurosvet 30023/3 белый с золотом','2768.00','1','113270_01.jpg',15),(50,'Подвесная люстра Ambiente by Brizzi Tenerife 02166/8 WP','72973.00','1','106850_01.jpg',14),(51,'Люстра Leandra WE370.10.503','125812.00','1','075059_1.jpg',6),(52,'Люстра Фьюжен 392015220','54010.00','1','092969_1.jpg',3),(53,'Люстра 142-503-08','21911.00','1','025284_1.jpg',5),(54,'Люстра ELEGANT 51 ARM610-22-R','9540.00','1','077714_1_1.jpg',9),(55,'Потолочный светильник Ufo _1893','16189.00','2','083791_1.jpg',13),(56,'Настенно-потолочный светильник Nowodvorski 6383 Puzzle Rosse I','1563.00','1','116417_01.jpg',16),(57,'Подвесной светильник Divinare 2247/03 SP-1','3950.00','1','118591_01.jpg',17),(58,'Подвесной светильник Lobby 82863','5990.00','1','044646_1.jpg',10),(59,'Подвесной светильник IDLamp Arien 400/6-LEDWhitechrome','41990.00','1','102951_1.jpg',20),(60,'Подвесная люстра Bogate`s 227/6','15246.00','1','107685_01.jpg',21),(61,'Светильник  Lord 5433-2','1850.00','2','016996_1_1.jpg',4),(62,'Люстра Konik 632','4070.00','2','017437_1.jpg',19),(63,'Люстра Кармен 394010318','33570.00','1','067959_1.jpg',18),(64,'Потолочный светильник Maxime 49213','21900.00','1','080818_1.jpg',4),(65,'Люстра потолочная светодиодная Globo Caliban 67050-32D','30900.00','2','081075_1.jpg',4),(66,'Настенно-потолочный светильник 54984-6','13550.00','1','056469_1.jpg',4),(67,'Светильник настенно-потолочный Juno 57632/70','7915.00','1','048891_1.jpg',22),(68,'Светильник Kuriana 5645-1','1900.00','1','016483_1_1.jpg',4),(69,'Светильник  Kuriana 5645-2','2750.00','1','016484_1_1.jpg',4),(70,'Подвесная люстра Аврора Констанция 10052-5L','10530.00','1','107581_01.jpg',24),(71,'Люстра LSP-0102','6884.00','1','072492_1.jpg',11),(72,'Подвесная люстра TK Lighting 1888 Julia 5','7358.00','2','116453_01.jpg',29),(73,'Подвесной светильник Pulse LSP-9606','5509.00','1','072579_1.jpg',28),(74,'Светильник потолочный Gaio quadrata bianca 1554.20','15570.00','1','062684_1.jpg',23),(75,'Люстра Ретро РЛ 1505АХ/Б','4650.00','1','030502_1.jpg',26),(76,'Люстра Грация 358017005','8170.00','1','094889_1.jpg',30),(77,'Люстра  Хоф 497011801','4780.00','2','085118_01.jpg',27),(78,'Подвесной светильник BD 03200/4 Chrome','8100.00','1','082848_1.jpg',33),(79,'Люстра Виола Л16С3-06-С','7275.00','1','030665_01.jpg',32),(80,'Люстра Namat Faria 711/2','6117.00','1','017678_1.jpg',34),(81,'Люстра 17435 Balerina 5 бежевый','7202.00','1','060901_1.jpg',31),(82,'Люстра 25 дуб','2357.00','2','017648_1.jpg',25),(83,'Подвесная люстра Тарьсма Геркулес-8','13815.00','1','119570_01.jpg',36),(84,'Настенно-потолочный светильник Sonex Lakrima 128','2415.00','1','098155_1.jpg',35),(85,'Спот Hales 2613/1W','1203.00','1','059446_1.jpg',2),(86,'Люстра Г Буше 1-9698-10-CR-LED Y G4','8330.00','1','065750_1.jpg',7),(87,'Светильник настенно-потолочный Brindisi LSX-6709-04','7374.00','2','028508_1.jpg',12),(88,'Подвесной светильник Favourite 1665-1P','7480.00','2','113428_01.jpg',1),(89,'Подвесная люстра Ambiente by Brizzi Leon 2128/12 PB New Leaf','162407.00','2','106929_01.jpg',14),(90,'Люстра Virginia WE354.05.603','21568.00','1','058786_1.jpg',6),(91,'Светильник из дерева 513-717-01','2093.00','1','012583_1_1.jpg',5),(92,'Люстра OML-39907-05','6180.00','2','094650_01.jpg',8),(93,'Потолочный светильник MN 0429','13720.00','1','083412_1.jpg',13),(94,'Потолочная люстра Eurosvet 70020/4 хром/серый','7051.00','1','107665_01.jpg',15),(95,'Люстра ELEGANT 51 ARM610-22-W','9540.00','1','077715_1_1.jpg',9),(96,'Люстра Паула 411011212','194040.00','1','092971_1_1.jpg',3),(97,'Подвесная люстра Bogate`s 325/9 Strotskis','28132.00','1','104634_01.jpg',21),(98,'Светильник настенно-потолочный Livorno 90288/11','1995.00','1','049126_1.jpg',22),(99,'Подвесной светильник Bluszcz 15813','5493.00','2','017403_01.jpg',19),(100,'Светильник подвесной Fargo 88853','5790.00','1','043712_1.jpg',10);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
